tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Open-source code editor
cask "visual-studio-code"
mas "24 Hour Wallpaper", id: 1226087575
mas "Kindle", id: 302584613
mas "Remote Desktop", id: 409907375
mas "Rosetta Stone", id: 1476088902
mas "TextSniper", id: 1528890965
