tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk@17"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Screen recorder and video editor
cask "camtasia"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Virtual globe
cask "google-earth-pro"
# Mind mapping tool
cask "ithoughtsx"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# PDF reader, editor and annotator
cask "pdf-expert"
# Screen capture software
cask "snagit"
# Trading software
cask "trader-workstation"
# Charting and social-networking for investment traders
cask "tradingview"
# Open-source code editor
cask "visual-studio-code"
# Resources for Wacom tablets
cask "wacom-tablet"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "24 Hour Wallpaper", id: 1226087575
mas "Final Cut Pro", id: 424389933
mas "Kindle", id: 302584613
mas "Microsoft To Do", id: 1274495053
mas "Remote Desktop", id: 409907375
mas "Rosetta Stone", id: 1476088902
mas "TextSniper", id: 1528890965
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "pedro-bronsveld.anki-editor"
